podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
<!--
Devices using this peripheral: 
      MKW41Z4
-->
      <peripheral>
         <?sourceFile "XCVR_TSM_MKW41Z4" ?>
         <name>XCVR_TSM</name>
         <description>XCVR_TSM</description>
         <groupName>XCVR_TSM</groupName>
         <headerStructName>XCVR_TSM</headerStructName>
         <baseAddress>0x4005C2C0</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x11C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>TRANSCEIVER SEQUENCE MANAGER CONTROL</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0xFF004000</resetValue>
               <fields>
                  <field>
                     <name>FORCE_TX_EN</name>
                     <description>Force Transmit Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TSM Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSM executes a TX sequence</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FORCE_RX_EN</name>
                     <description>Force Receive Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TSM Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSM executes a RX sequence</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PA_RAMP_SEL</name>
                     <description>PA Ramp Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DATA_PADDING_EN</name>
                     <description>Data Padding Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>00</name>
                           <description>Disable TX Data Padding</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>01</name>
                           <description>Enable TX Data Padding</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSM_IRQ0_EN</name>
                     <description>TSM_IRQ0 Enable/Disable bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TSM_IRQ0 is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSM_IRQ0 is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSM_IRQ1_EN</name>
                     <description>TSM_IRQ1 Enable/Disable bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>TSM_IRQ1 is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSM_IRQ1 is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RAMP_DN_DELAY</name>
                     <description>PA Ramp Down Delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TX_ABORT_DIS</name>
                     <description>Transmit Abort Disable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ABORT_DIS</name>
                     <description>Receive Abort Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT_ON_CTUNE</name>
                     <description>Abort On Coarse Tune Lock Detect Failure</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>don&apos;t allow TSM abort on Coarse Tune Unlock Detect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>allow TSM abort on Coarse Tune Unlock Detect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABORT_ON_CYCLE_SLIP</name>
                     <description>Abort On Cycle Slip Lock Detect Failure</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>don&apos;t allow TSM abort on Cycle Slip Unlock Detect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>allow TSM abort on Cycle Slip Unlock Detect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ABORT_ON_FREQ_TARG</name>
                     <description>Abort On Frequency Target Lock Detect Failure</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>don&apos;t allow TSM abort on Frequency Target Unlock Detect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>allow TSM abort on Frequency Target Unlock Detect</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BKPT</name>
                     <description>TSM Breakpoint</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>END_OF_SEQ</name>
               <description>TSM END OF SEQUENCE</description>
               <addressOffset>0x4</addressOffset>
               <resetValue>0x67666A63</resetValue>
               <fields>
                  <field>
                     <name>END_OF_TX_WU</name>
                     <description>End of TX Warmup</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>END_OF_TX_WD</name>
                     <description>End of TX Warmdown</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>END_OF_RX_WU</name>
                     <description>End of RX Warmup</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>END_OF_RX_WD</name>
                     <description>End of RX Warmdown</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
