podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
            <register>
               <name>OVRD0</name>
               <description>TSM OVERRIDE REGISTER 0</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>BB_LDO_HF_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_HF_EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_HF_EN_OVRD to override the signal &quot;bb_ldo_hf_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_HF_EN_OVRD</name>
                     <description>Override value for BB_LDO_HF_EN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_ADCDAC_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_ADCDAC_EN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_ADCDAC_EN_OVRD to override the signal &quot;bb_ldo_adcdac_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_ADCDAC_EN_OVRD</name>
                     <description>Override value for BB_LDO_ADCDAC_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_BBA_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_BBA_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_BBA_EN_OVRD to override the signal &quot;bb_ldo_bba_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_BBA_EN_OVRD</name>
                     <description>Override value for BB_LDO_BBA_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_PD_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_PD_EN</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_PD_EN_OVRD to override the signal &quot;bb_ldo_pd_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_PD_EN_OVRD</name>
                     <description>Override value for BB_LDO_PD_EN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_FDBK_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_FDBK_EN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_FDBK_EN_OVRD to override the signal &quot;bb_ldo_fdbk_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_FDBK_EN_OVRD</name>
                     <description>Override value for BB_LDO_FDBK_EN</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_VCOLO_EN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_VCOLO_EN_OVRD to override the signal &quot;bb_ldo_vcolo_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_EN_OVRD</name>
                     <description>Override value for BB_LDO_VCOLO_EN</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_VTREF_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_VTREF_EN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_VTREF_EN_OVRD to override the signal &quot;bb_ldo_vtref_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_VTREF_EN_OVRD</name>
                     <description>Override value for BB_LDO_VTREF_EN</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_FDBK_BLEED_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_FDBK_BLEED_EN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_FDBK_BLEED_EN_OVRD to override the signal &quot;bb_ldo_fdbk_bleed_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_FDBK_BLEED_EN_OVRD</name>
                     <description>Override value for BB_LDO_FDBK_BLEED_EN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_BLEED_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_VCOLO_BLEED_EN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_VCOLO_BLEED_EN_OVRD to override the signal &quot;bb_ldo_vcolo_bleed_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_BLEED_EN_OVRD</name>
                     <description>Override value for BB_LDO_VCOLO_BLEED_EN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_FASTCHARGE_EN_OVRD_EN</name>
                     <description>Override control for BB_LDO_VCOLO_FASTCHARGE_EN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_LDO_VCOLO_FASTCHARGE_EN_OVRD to override the signal &quot;bb_ldo_vcolo_fastcharge_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_LDO_VCOLO_FASTCHARGE_EN_OVRD</name>
                     <description>Override value for BB_LDO_VCOLO_FASTCHARGE_EN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_XTAL_PLL_REF_CLK_EN_OVRD_EN</name>
                     <description>Override control for BB_XTAL_PLL_REF_CLK_EN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_XTAL_PLL_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_pll_ref_clk_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_XTAL_PLL_REF_CLK_EN_OVRD</name>
                     <description>Override value for BB_XTAL_PLL_REF_CLK_EN</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_XTAL_DAC_REF_CLK_EN_OVRD_EN</name>
                     <description>Override control for BB_XTAL_DAC_REF_CLK_EN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_XTAL_DAC_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_dac_ref_clk_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_XTAL_DAC_REF_CLK_EN_OVRD</name>
                     <description>Override value for BB_XTAL_DAC_REF_CLK_EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BB_XTAL_AUXPLL_REF_CLK_EN_OVRD_EN</name>
                     <description>Override control for BB_XTAL_AUXPLL_REF_CLK_EN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of BB_XTAL_AUXPLL_REF_CLK_EN_OVRD to override the signal &quot;bb_xtal_auxpll_ref_clk_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB_XTAL_AUXPLL_REF_CLK_EN_OVRD</name>
                     <description>Override value for BB_XTAL_AUXPLL_REF_CLK_EN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_VCO_AUTOTUNE_EN_OVRD_EN</name>
                     <description>Override control for SY_VCO_AUTOTUNE_EN</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_VCO_AUTOTUNE_EN_OVRD to override the signal &quot;sy_vco_autotune_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_AUTOTUNE_EN_OVRD</name>
                     <description>Override value for SY_VCO_AUTOTUNE_EN</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_CYCLE_SLIP_LD_EN_OVRD_EN</name>
                     <description>Override control for SY_PD_CYCLE_SLIP_LD_EN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_PD_CYCLE_SLIP_LD_EN_OVRD to override the signal &quot;sy_pd_cycle_slip_ld_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_PD_CYCLE_SLIP_LD_EN_OVRD</name>
                     <description>Override value for SY_PD_CYCLE_SLIP_LD_EN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_VCO_EN_OVRD_EN</name>
                     <description>Override control for SY_VCO_EN</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_VCO_EN_OVRD to override the signal &quot;sy_vco_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_VCO_EN_OVRD</name>
                     <description>Override value for SY_VCO_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
