podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
            <register>
               <name>OVRD1</name>
               <description>TSM OVERRIDE REGISTER 1</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>SY_LO_RX_BUF_EN_OVRD_EN</name>
                     <description>Override control for SY_LO_RX_BUF_EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_LO_RX_BUF_EN_OVRD to override the signal &quot;sy_lo_rx_buf_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_RX_BUF_EN_OVRD</name>
                     <description>Override value for SY_LO_RX_BUF_EN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_LO_TX_BUF_EN_OVRD_EN</name>
                     <description>Override control for SY_LO_TX_BUF_EN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_LO_TX_BUF_EN_OVRD to override the signal &quot;sy_lo_tx_buf_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_TX_BUF_EN_OVRD</name>
                     <description>Override value for SY_LO_TX_BUF_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_DIVN_EN_OVRD_EN</name>
                     <description>Override control for SY_DIVN_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_DIVN_EN_OVRD to override the signal &quot;sy_divn_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_DIVN_EN_OVRD</name>
                     <description>Override value for SY_DIVN_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_FILTER_CHARGE_EN_OVRD_EN</name>
                     <description>Override control for SY_PD_FILTER_CHARGE_EN</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_PD_FILTER_CHARGE_EN_OVRD to override the signal &quot;sy_pd_filter_charge_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_PD_FILTER_CHARGE_EN_OVRD</name>
                     <description>Override value for SY_PD_FILTER_CHARGE_EN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_PD_EN_OVRD_EN</name>
                     <description>Override control for SY_PD_EN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_PD_EN_OVRD to override the signal &quot;sy_pd_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_PD_EN_OVRD</name>
                     <description>Override value for SY_PD_EN</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_LO_DIVN_EN_OVRD_EN</name>
                     <description>Override control for SY_LO_DIVN_EN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_LO_DIVN_EN_OVRD to override the signal &quot;sy_lo_divn_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_DIVN_EN_OVRD</name>
                     <description>Override value for SY_LO_DIVN_EN</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_LO_RX_EN_OVRD_EN</name>
                     <description>Override control for SY_LO_RX_EN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_LO_RX_EN_OVRD to override the signal &quot;sy_lo_rx_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_RX_EN_OVRD</name>
                     <description>Override value for SY_LO_RX_EN</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_LO_TX_EN_OVRD_EN</name>
                     <description>Override control for SY_LO_TX_EN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_LO_TX_EN_OVRD to override the signal &quot;sy_lo_tx_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_LO_TX_EN_OVRD</name>
                     <description>Override value for SY_LO_TX_EN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SY_DIVN_CAL_EN_OVRD_EN</name>
                     <description>Override control for SY_DIVN_CAL_EN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SY_DIVN_CAL_EN_OVRD to override the signal &quot;sy_divn_cal_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SY_DIVN_CAL_EN_OVRD</name>
                     <description>Override value for SY_DIVN_CAL_EN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_MIXER_EN_OVRD_EN</name>
                     <description>Override control for RX_MIXER_EN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_MIXER_EN_OVRD to override the signal &quot;rx_mixer_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_MIXER_EN_OVRD</name>
                     <description>Override value for RX_MIXER_EN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_PA_EN_OVRD_EN</name>
                     <description>Override control for TX_PA_EN</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of TX_PA_EN_OVRD to override the signal &quot;tx_pa_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_PA_EN_OVRD</name>
                     <description>Override value for TX_PA_EN</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_I_EN_OVRD_EN</name>
                     <description>Override control for RX_ADC_I_EN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_ADC_I_EN_OVRD to override the signal &quot;rx_adc_i_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_ADC_I_EN_OVRD</name>
                     <description>Override value for RX_ADC_I_EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_Q_EN_OVRD_EN</name>
                     <description>Override control for RX_ADC_Q_EN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_ADC_Q_EN_OVRD to override the signal &quot;rx_adc_q_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_ADC_Q_EN_OVRD</name>
                     <description>Override value for RX_ADC_Q_EN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_ADC_RESET_EN_OVRD_EN</name>
                     <description>Override control for RX_ADC_RESET_EN</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_ADC_RESET_EN_OVRD to override the signal &quot;rx_adc_reset_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_ADC_RESET_EN_OVRD</name>
                     <description>Override value for RX_ADC_RESET_EN</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BBA_I_EN_OVRD_EN</name>
                     <description>Override control for RX_BBA_I_EN</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_BBA_I_EN_OVRD to override the signal &quot;rx_bba_i_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_BBA_I_EN_OVRD</name>
                     <description>Override value for RX_BBA_I_EN</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BBA_Q_EN_OVRD_EN</name>
                     <description>Override control for RX_BBA_Q_EN</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_BBA_Q_EN_OVRD to override the signal &quot;rx_bba_q_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_BBA_Q_EN_OVRD</name>
                     <description>Override value for RX_BBA_Q_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
