podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
            <register>
               <name>OVRD2</name>
               <description>TSM OVERRIDE REGISTER 2</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>RX_BBA_PDET_EN_OVRD_EN</name>
                     <description>Override control for RX_BBA_PDET_EN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_BBA_PDET_EN_OVRD to override the signal &quot;rx_bba_pdet_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_BBA_PDET_EN_OVRD</name>
                     <description>Override value for RX_BBA_PDET_EN</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_BBA_DCOC_EN_OVRD_EN</name>
                     <description>Override control for RX_BBA_DCOC_EN</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_BBA_DCOC_EN_OVRD to override the signal &quot;rx_bba_dcoc_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_BBA_DCOC_EN_OVRD</name>
                     <description>Override value for RX_BBA_DCOC_EN</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_LNA_EN_OVRD_EN</name>
                     <description>Override control for RX_LNA_EN</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_LNA_EN_OVRD to override the signal &quot;rx_lna_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_LNA_EN_OVRD</name>
                     <description>Override value for RX_LNA_EN</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_I_EN_OVRD_EN</name>
                     <description>Override control for RX_TZA_I_EN</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_TZA_I_EN_OVRD to override the signal &quot;rx_tza_i_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_TZA_I_EN_OVRD</name>
                     <description>Override value for RX_TZA_I_EN</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_Q_EN_OVRD_EN</name>
                     <description>Override control for RX_TZA_Q_EN</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_TZA_Q_EN_OVRD to override the signal &quot;rx_tza_q_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_TZA_Q_EN_OVRD</name>
                     <description>Override value for RX_TZA_Q_EN</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_PDET_EN_OVRD_EN</name>
                     <description>Override control for RX_TZA_PDET_EN</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_TZA_PDET_EN_OVRD to override the signal &quot;rx_tza_pdet_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_TZA_PDET_EN_OVRD</name>
                     <description>Override value for RX_TZA_PDET_EN</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_TZA_DCOC_EN_OVRD_EN</name>
                     <description>Override control for RX_TZA_DCOC_EN</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_TZA_DCOC_EN_OVRD to override the signal &quot;rx_tza_dcoc_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RX_TZA_DCOC_EN_OVRD_EN" > <name>RX_TZA_DCOC_EN_OVRD</name> <bitOffset>13</bitOffset> </field>
                  <field>
                     <name>PLL_DIG_EN_OVRD_EN</name>
                     <description>Override control for PLL_DIG_EN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of PLL_DIG_EN_OVRD to override the signal &quot;pll_dig_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLL_DIG_EN_OVRD</name>
                     <description>Override value for PLL_DIG_EN</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TX_DIG_EN_OVRD_EN</name>
                     <description>Override control for TX_DIG_EN</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of TX_DIG_EN_OVRD to override the signal &quot;tx_dig_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_DIG_EN_OVRD</name>
                     <description>Override value for TX_DIG_EN</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_DIG_EN_OVRD_EN</name>
                     <description>Override control for RX_DIG_EN</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_DIG_EN_OVRD to override the signal &quot;rx_dig_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_DIG_EN_OVRD</name>
                     <description>Override value for RX_DIG_EN</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_INIT_OVRD_EN</name>
                     <description>Override control for RX_INIT</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_INIT_OVRD to override the signal &quot;rx_init&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_INIT_OVRD</name>
                     <description>Override value for RX_INIT</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIGMA_DELTA_EN_OVRD_EN</name>
                     <description>Override control for SIGMA_DELTA_EN</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of SIGMA_DELTA_EN_OVRD to override the signal &quot;sigma_delta_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIGMA_DELTA_EN_OVRD</name>
                     <description>Override value for SIGMA_DELTA_EN</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_PHY_EN_OVRD_EN</name>
                     <description>Override control for RX_PHY_EN</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of RX_PHY_EN_OVRD to override the signal &quot;rx_phy_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_PHY_EN_OVRD</name>
                     <description>Override value for RX_PHY_EN</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_EN_OVRD_EN</name>
                     <description>Override control for DCOC_EN</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of DCOC_EN_OVRD to override the signal &quot;dcoc_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_EN_OVRD</name>
                     <description>Override value for DCOC_EN</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_INIT_OVRD_EN</name>
                     <description>Override control for DCOC_INIT</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of DCOC_INIT_OVRD to override the signal &quot;dcoc_init&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DCOC_INIT_OVRD</name>
                     <description>Override value for DCOC_INIT</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FREQ_TARG_LD_EN_OVRD_EN</name>
                     <description>Override control for FREQ_TARG_LD_EN</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Use the state of FREQ_TARG_LD_EN_OVRD to override the signal &quot;freq_targ_ld_en&quot;</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FREQ_TARG_LD_EN_OVRD</name>
                     <description>Override value for FREQ_TARG_LD_EN</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
