podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
            <register>
               <name>TIMING35</name>
               <description>TSM_TIMING35</description>
               <addressOffset>0xBC</addressOffset>
               <resetValue>0xFFFF6A5D</resetValue>
               <fields>
                  <field>
                     <name>TX_DIG_EN_TX_HI</name>
                     <description>Assertion time setting for TX_DIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TX_DIG_EN_TX_LO</name>
                     <description>De-assertion time setting for TX_DIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING36</name>
               <description>TSM_TIMING36</description>
               <addressOffset>0xC0</addressOffset>
               <resetValue>0x6764FFFF</resetValue>
               <fields>
                  <field>
                     <name>RX_DIG_EN_RX_HI</name>
                     <description>Assertion time setting for RX_DIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RX_DIG_EN_RX_LO</name>
                     <description>De-assertion time setting for RX_DIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING37</name>
               <description>TSM_TIMING37</description>
               <addressOffset>0xC4</addressOffset>
               <resetValue>0x6564FFFF</resetValue>
               <fields>
                  <field>
                     <name>RX_INIT_RX_HI</name>
                     <description>Assertion time setting for RX_INIT (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RX_INIT_RX_LO</name>
                     <description>De-assertion time setting for RX_INIT (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING38</name>
               <description>TSM_TIMING38</description>
               <addressOffset>0xC8</addressOffset>
               <resetValue>0x670C6A40</resetValue>
               <fields>
                  <field>
                     <name>SIGMA_DELTA_EN_TX_HI</name>
                     <description>Assertion time setting for SIGMA_DELTA_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SIGMA_DELTA_EN_TX_LO</name>
                     <description>De-assertion time setting for SIGMA_DELTA_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SIGMA_DELTA_EN_RX_HI</name>
                     <description>Assertion time setting for SIGMA_DELTA_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SIGMA_DELTA_EN_RX_LO</name>
                     <description>De-assertion time setting for SIGMA_DELTA_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING39</name>
               <description>TSM_TIMING39</description>
               <addressOffset>0xCC</addressOffset>
               <resetValue>0x6764FFFF</resetValue>
               <fields>
                  <field>
                     <name>RX_PHY_EN_RX_HI</name>
                     <description>Assertion time setting for RX_PHY_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RX_PHY_EN_RX_LO</name>
                     <description>De-assertion time setting for RX_PHY_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING40</name>
               <description>TSM_TIMING40</description>
               <addressOffset>0xD0</addressOffset>
               <resetValue>0x6724FFFF</resetValue>
               <fields>
                  <field>
                     <name>DCOC_EN_RX_HI</name>
                     <description>Assertion time setting for DCOC_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_EN_RX_LO</name>
                     <description>De-assertion time setting for DCOC_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING41</name>
               <description>TSM_TIMING41</description>
               <addressOffset>0xD4</addressOffset>
               <resetValue>0x2524FFFF</resetValue>
               <fields>
                  <field>
                     <name>DCOC_INIT_RX_HI</name>
                     <description>Assertion time setting for DCOC_INIT (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DCOC_INIT_RX_LO</name>
                     <description>De-assertion time setting for DCOC_INIT (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING42</name>
               <description>TSM_TIMING42</description>
               <addressOffset>0xD8</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>SAR_ADC_TRIG_EN_TX_HI</name>
                     <description>Assertion time setting for SAR_ADC_TRIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAR_ADC_TRIG_EN_TX_LO</name>
                     <description>De-assertion time setting for SAR_ADC_TRIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAR_ADC_TRIG_EN_RX_HI</name>
                     <description>Assertion time setting for SAR_ADC_TRIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SAR_ADC_TRIG_EN_RX_LO</name>
                     <description>De-assertion time setting for SAR_ADC_TRIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING43</name>
               <description>TSM_TIMING43</description>
               <addressOffset>0xDC</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TSM_SPARE0_EN_TX_HI</name>
                     <description>Assertion time setting for TSM_SPARE0_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE0_EN_TX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE0_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE0_EN_RX_HI</name>
                     <description>Assertion time setting for TSM_SPARE0_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE0_EN_RX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE0_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING44</name>
               <description>TSM_TIMING44</description>
               <addressOffset>0xE0</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TSM_SPARE1_EN_TX_HI</name>
                     <description>Assertion time setting for TSM_SPARE1_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE1_EN_TX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE1_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE1_EN_RX_HI</name>
                     <description>Assertion time setting for TSM_SPARE1_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE1_EN_RX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE1_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING45</name>
               <description>TSM_TIMING45</description>
               <addressOffset>0xE4</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TSM_SPARE2_EN_TX_HI</name>
                     <description>Assertion time setting for TSM_SPARE2_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE2_EN_TX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE2_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE2_EN_RX_HI</name>
                     <description>Assertion time setting for TSM_SPARE2_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE2_EN_RX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE2_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING46</name>
               <description>TSM_TIMING46</description>
               <addressOffset>0xE8</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>TSM_SPARE3_EN_TX_HI</name>
                     <description>Assertion time setting for TSM_SPARE3_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE3_EN_TX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE3_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE3_EN_RX_HI</name>
                     <description>Assertion time setting for TSM_SPARE3_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TSM_SPARE3_EN_RX_LO</name>
                     <description>De-assertion time setting for TSM_SPARE3_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING47</name>
               <description>TSM_TIMING47</description>
               <addressOffset>0xEC</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>GPIO0_TRIG_EN_TX_HI</name>
                     <description>Assertion time setting for GPIO0_TRIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO0_TRIG_EN_TX_LO</name>
                     <description>De-assertion time setting for GPIO0_TRIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO0_TRIG_EN_RX_HI</name>
                     <description>Assertion time setting for GPIO0_TRIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO0_TRIG_EN_RX_LO</name>
                     <description>De-assertion time setting for GPIO0_TRIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING48</name>
               <description>TSM_TIMING48</description>
               <addressOffset>0xF0</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>GPIO1_TRIG_EN_TX_HI</name>
                     <description>Assertion time setting for GPIO1_TRIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO1_TRIG_EN_TX_LO</name>
                     <description>De-assertion time setting for GPIO1_TRIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO1_TRIG_EN_RX_HI</name>
                     <description>Assertion time setting for GPIO1_TRIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO1_TRIG_EN_RX_LO</name>
                     <description>De-assertion time setting for GPIO1_TRIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING49</name>
               <description>TSM_TIMING49</description>
               <addressOffset>0xF4</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>GPIO2_TRIG_EN_TX_HI</name>
                     <description>Assertion time setting for GPIO2_TRIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO2_TRIG_EN_TX_LO</name>
                     <description>De-assertion time setting for GPIO2_TRIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO2_TRIG_EN_RX_HI</name>
                     <description>Assertion time setting for GPIO2_TRIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO2_TRIG_EN_RX_LO</name>
                     <description>De-assertion time setting for GPIO2_TRIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING50</name>
               <description>TSM_TIMING50</description>
               <addressOffset>0xF8</addressOffset>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>GPIO3_TRIG_EN_TX_HI</name>
                     <description>Assertion time setting for GPIO3_TRIG_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO3_TRIG_EN_TX_LO</name>
                     <description>De-assertion time setting for GPIO3_TRIG_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO3_TRIG_EN_RX_HI</name>
                     <description>Assertion time setting for GPIO3_TRIG_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>GPIO3_TRIG_EN_RX_LO</name>
                     <description>De-assertion time setting for GPIO3_TRIG_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING51</name>
               <description>TSM_TIMING51</description>
               <addressOffset>0xFC</addressOffset>
               <resetValue>0x6703FFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_BIAS_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_BIAS_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_BIAS_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING52</name>
               <description>TSM_TIMING52</description>
               <addressOffset>0x100</addressOffset>
               <resetValue>0x1504FFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_FCAL_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_FCAL_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_FCAL_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING53</name>
               <description>TSM_TIMING53</description>
               <addressOffset>0x104</addressOffset>
               <resetValue>0x6704FFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_LF_PD_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_LF_PD_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_LF_PD_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING54</name>
               <description>TSM_TIMING54</description>
               <addressOffset>0x108</addressOffset>
               <resetValue>0x1504FFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_PD_LF_FILTER_CHARGE_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
