podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/XCVR_TSM_MKW41Z4.svd.xml
            <register>
               <name>TIMING55</name>
               <description>TSM_TIMING55</description>
               <addressOffset>0x10C</addressOffset>
               <resetValue>0x671EFFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_ADC_BUF_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_ADC_BUF_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_ADC_BUF_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING56</name>
               <description>TSM_TIMING56</description>
               <addressOffset>0x110</addressOffset>
               <resetValue>0x671EFFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_AUXPLL_DIG_BUF_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_AUXPLL_DIG_BUF_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_AUXPLL_DIG_BUF_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING57</name>
               <description>TSM_TIMING57</description>
               <addressOffset>0x114</addressOffset>
               <resetValue>0x1A03FFFF</resetValue>
               <fields>
                  <field>
                     <name>RXTX_RCCAL_EN_RX_HI</name>
                     <description>Assertion time setting for RXTX_RCCAL_EN (RX)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXTX_RCCAL_EN_RX_LO</name>
                     <description>De-assertion time setting for RXTX_RCCAL_EN (RX)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIMING58</name>
               <description>TSM_TIMING58</description>
               <addressOffset>0x118</addressOffset>
               <resetValue>0xFFFF6A03</resetValue>
               <fields>
                  <field>
                     <name>TX_HPM_DAC_EN_TX_HI</name>
                     <description>Assertion time setting for TX_HPM_DAC_EN (TX)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TX_HPM_DAC_EN_TX_LO</name>
                     <description>De-assertion time setting for TX_HPM_DAC_EN (TX)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
